/*************************************************************************************
 * 文件:    config.h
 *
 * 描述:    SLC设置
 *
 * 作者:    Jun
 *
 * 时间:    2011-2-20
*************************************************************************************/
#ifndef SLC_CONFIG_H
#define SLC_CONFIG_H

/*------------------------------------------------------------------------------------
 * 
 *          分压机配置数据结构
 * 
**----------------------------------------------------------------------------------*/
struct slc_config_s {                
    INT32U magic;               /* 文件有效标识 */
    struct __port {             /* 串口设置     */                   
        INT16S base;
        INT32S baudrate;
        INT16S data;
        INT16S stop;
        INT08S parity;
        INT16S int_no;
    } com_port[4];
    slc_descriptor_t slc[2];    /* 分压机       */
    int slc_used;               /* 0=需选择, 1=用机1, 2=用机2, 3=用机1&2 */
};

/*------------------------------------------------------------------------------------
 * 
 *      函数声明
 * 
**----------------------------------------------------------------------------------*/
BOOL  read_config(void);
BOOL  save_config(void);
BOOL  check_config(void);
BOOL  active_config(void);
void  read_init_setup(void);

void  config_init_gui(void);
BOOL  modify_config(int slc_no);






#endif /* #ifndef SLC_CONFIG_H */

/*====================================================================================
 * 
 * 本文件结束: config.h
 * 
**==================================================================================*/

